#include "MenusAndIntros.h"
#include "CommandLineParser.h"


#ifdef __linux__
void _strupr(char* s)
{
	char* p = s;

	while (*p) {
		*p = toupper(*p);
		++p;
	}
}
#else //__linux__
#endif //__linux__

bool first_enter = true;

__int16 x_WORD_17DBC4 = 0; // weak//x_DWORD_17DBB8[3] 34ebc4

char x_BYTE_E1B9C[8] = { '\0', '\0', '\0', '\0', '\0', '\0', '\0', '\0' }; // idb x_WORD_E1964x[0x238+
char x_BYTE_E1BA4[8] = { '\0', '\0', '\0', '\0', '\0', '\0', '\0', '\0' }; // idb x_WORD_E1964x[0x240+


#pragma pack (1)
typedef struct {//lenght 7
	Type_SoundEvent_E17CC* pSoundEvent_0;
	uint8_t byte_4;
	uint8_t byte_5;
	uint8_t byte_6;
}
type_E16E0;
#pragma pack (16)

Type_SoundEvent_E17CC str_E1328[28] = {
{0x0000,0x45,0x00000005},
{0x0000,0x56,0x00000000},
{0x0000,0x57,0x00000000},
{0x0000,0x41,0x00000005},
{0x0001,0x4D,0x00000006},
{0x0018,0x53,0x00000002},
{0x0042,0x53,0x00000002},
{0x0046,0x53,0x00000002},
{0x0048,0x53,0x00000002},
{0x005C,0x53,0x00000002},
{0x005E,0x53,0x00000002},
{0x007C,0x57,0x00000000},
{0x007C,0x55,0x0000010A},
{0x007C,0x41,0x0000000A},
{0x007C,0x53,0x00000001},
{0x00D2,0x57,0x00000000},
{0x00D2,0x55,0x0000010B},
{0x0118,0x57,0x00000000},
{0x0118,0x55,0x0000010C},
{0x0154,0x57,0x00000000},
{0x0154,0x55,0x0000010D},
{0x01C2,0x57,0x00000000},
{0x01C2,0x59,0x00000000},
{0x01CC,0x53,0x00000003},
{0x01D6,0x53,0x00000003},
{0x01DA,0x53,0x00000003},
{0x01DE,0x53,0x00000003},
{0xFFFF,0xFF,0x00000001}};

Type_SoundEvent_E17CC str_E13EC[27] = {
{0x0000,0x45,0x00000006},
{0x0000,0x56,0x00000000},
{0x0000,0x57,0x00000000},
{0x0000,0x41,0x00000005},
{0x0001,0x4D,0x00000006},
{0x0018,0x53,0x00000002},
{0x0042,0x53,0x00000002},
{0x0046,0x53,0x00000002},
{0x0048,0x53,0x00000002},
{0x005C,0x53,0x00000002},
{0x005E,0x53,0x00000002},
{0x007C,0x57,0x00000000},
{0x007C,0x55,0x0000010E},
{0x007C,0x41,0x0000000A},
{0x007C,0x53,0x00000001},
{0x00C8,0x57,0x00000000},
{0x00C8,0x55,0x0000010F},
{0x0118,0x57,0x00000000},
{0x0118,0x55,0x00000110},
{0x0154,0x57,0x00000000},
{0x0154,0x55,0x00000111},
{0x01B8,0x53,0x00000003},
{0x01C2,0x59,0x00000000},
{0x01D0,0x53,0x00000003},
{0x01DE,0x53,0x00000003},
{0x0203,0x53,0x00000003},
{0xFFFF,0xFF,0x00000001} };

Type_SoundEvent_E17CC str_E14AC[28] = {
{0x0000,0x45,0x00000007},
{0x0000,0x56,0x00000000},
{0x0000,0x57,0x00000000},
{0x0000,0x41,0x00000005},
{0x0001,0x4D,0x00000006},
{0x0018,0x53,0x00000002},
{0x0042,0x53,0x00000002},
{0x0046,0x53,0x00000002},
{0x0048,0x53,0x00000002},
{0x005C,0x53,0x00000002},
{0x005E,0x53,0x00000002},
{0x007C,0x57,0x00000000},
{0x007C,0x55,0x00000112},
{0x007C,0x41,0x0000000A},
{0x007C,0x53,0x00000001},
{0x00DE,0x57,0x00000000},
{0x00DE,0x55,0x00000113},
{0x015E,0x59,0x00000000},
{0x0162,0x53,0x00000003},
{0x016C,0x53,0x00000003},
{0x0176,0x53,0x00000003},
{0x0180,0x53,0x00000003},
{0x018A,0x53,0x00000003},
{0x0194,0x53,0x00000003},
{0x019E,0x53,0x00000003},
{0x01A8,0x53,0x00000003},
{0x01B2,0x53,0x00000003},
{0xFFFF,0xFF,0x00000001} };

Type_SoundEvent_E17CC str_E1570[28] = {
{0x0000,0x45,0x00000008},
{0x0000,0x56,0x00000000},
{0x0000,0x57,0x00000000},
{0x0000,0x41,0x00000005},
{0x0001,0x4D,0x00000006},
{0x0018,0x53,0x00000002},
{0x0042,0x53,0x00000002},
{0x0046,0x53,0x00000002},
{0x0048,0x53,0x00000002},
{0x005C,0x53,0x00000002},
{0x005E,0x53,0x00000002},
{0x007C,0x57,0x00000000},
{0x007C,0x55,0x00000114},
{0x007C,0x41,0x0000000A},
{0x007C,0x53,0x00000001},
{0x00C8,0x57,0x00000000},
{0x00C8,0x55,0x00000115},
{0x0118,0x57,0x00000000},
{0x0118,0x55,0x00000116},
{0x015E,0x59,0x00000000},
{0x0168,0x53,0x00000003},
{0x016D,0x53,0x00000003},
{0x0172,0x53,0x00000003},
{0x017C,0x53,0x00000003},
{0x0181,0x53,0x00000003},
{0x0186,0x53,0x00000003},
{0x0190,0x53,0x00000003},
{0xFFFF,0xFF,0x00000001} };

Type_SoundEvent_E17CC str_E1634[20] = {
{ 0x0000,0x45,0x00000009 },
{ 0x0000,0x56,0x00000000 },
{ 0x0000,0x57,0x00000000 },
{ 0x0000,0x41,0x00000005 },
{ 0x0001,0x4D,0x00000006 },
{ 0x0018,0x53,0x00000002 },
{ 0x0042,0x53,0x00000002 },
{ 0x0046,0x53,0x00000002 },
{ 0x0048,0x53,0x00000002 },
{ 0x005C,0x53,0x00000002 },
{ 0x005E,0x53,0x00000002 },
{ 0x007C,0x57,0x00000000 },
{ 0x007C,0x55,0x00000117 },
{ 0x007C,0x41,0x0000000A },
{ 0x007C,0x53,0x00000001 },
{ 0x00C8,0x57,0x00000000 },
{ 0x00C8,0x55,0x00000118 },
{ 0xFFFF,0xFF,0x00000001 } };

Type_SoundEvent_E17CC str_E16B4[7] = {
{ 0x0000, 0x45, 0x00000004},
{ 0x0000,0x41,0x0000000A },
{ 0x0000,0x41,0x00000005 },
{ 0x0001,0x4D,0x00000002 },
{ 0x001E,0x53,0x00000009 },
{ 0x0038,0x53,0x0000000A },
{ 0x01FF,0x28,0x05002B23 } };

type_E16E0 str_E16E0[7] = {//cutscenes
{str_E1328,0x05,0x00,0x01},
{str_E13EC,0x09,0x00,0x02},
{str_E14AC,0x0D,0x00,0x03},
{str_E1570,0x11,0x00,0x04},
{str_E1634,0x18,0x00,0x05},
{str_E16B4,0x19,0x00,0x06},
{NULL,0x00,0x00,0x00}
};

type_x_BYTE_E25ED_db_str x_BYTE_E26C8_str[16] = {//set keys
{0x00000000,0x00000000,0x01BF,0x0274,0x0073,0x008A,0x0073,0x0004,0x00,0x01,0x0007,0x0026,0x0002,0x0000},
{0x00000000,0x00000000,0x036C,0x0216,0x0073,0x008A,0x0075,0x0008,0x00,0x01,0x0008,0x0026,0x0002,0x0000},
{0x00000000,0x00000000,0x0221,0x0036,0x0055,0x0055,0x0055,0x0000,0x01,0x00,0xFFFF,0x0000,0x0000,0x0000},
{0x00000000,0x00000000,0x028F,0x003A,0x0055,0x0055,0x0057,0x0000,0x01,0x00,0xFFFF,0x0000,0x0000,0x0000},
{0x00000000,0x00000000,0x0234,0x0058,0x0055,0x0055,0x0058,0x0000,0x01,0x00,0xFFFF,0x0000,0x0000,0x0000},
{0x00000000,0x00000000,0x0266,0x007B,0x0055,0x0055,0x0059,0x0000,0x01,0x00,0xFFFF,0x0000,0x0000,0x0000},
{0x00000000,0x00000000,0x0221,0x0036,0x0056,0x005C,0x0056,0x0008,0x00,0x01,0x0009,0x0017,0x0003,0x0000},
{0x00000000,0x00000000,0x028F,0x003A,0x0056,0x005C,0x0058,0x0004,0x00,0x01,0xFFFF,0x0017,0x0002,0x0000},
{0x00000000,0x00000000,0x0234,0x0058,0x0056,0x005C,0x0059,0x0016,0x00,0x01,0xFFFF,0x0017,0x0003,0x0000},
{0x00000000,0x00000000,0x0266,0x007B,0x0056,0x005C,0x005A,0x0015,0x00,0x01,0xFFFF,0x0017,0x0003,0x0000},
{0x00000000,0x00000000,0x033F,0x00F5,0x002E,0x003A,0x0031,0x0000,0x01,0x00,0x000A,0x0005,0x0002,0x0000},
{0x00000000,0x00000000,0x033F,0x00F5,0x002E,0x003A,0x0031,0x0000,0x01,0x01,0x000A,0x0005,0x0002,0xFFFF},
{0x00000000,0x00000000,0x035F,0x0149,0x002E,0x003A,0x002E,0x0000,0x01,0x00,0xFFFF,0x0005,0x0002,0x0000},
{0x00000000,0x00000000,0x0276,0x025F,0x002E,0x003A,0x0034,0x0000,0x01,0x00,0xFFFF,0x0005,0x0002,0x0000},
{0x00000000,0x00000000,0x00F4,0x0278,0x002E,0x003A,0x0038,0x0000,0x01,0x00,0xFFFF,0x0005,0x0002,0x0000},
{0x00000000,0x00000000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x00,0x00,0x0000,0x0000,0x0000,0x0000}
};

type_x_BYTE_E25ED_2BB str_BYTE_E2590[0x3] = {//set joy
{ 0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x01B5,0x0000,0x0001 },
{ 0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x01B6,0x0000,0x0002 },
{ 0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000 }
};

#pragma pack (1)
typedef struct {//lenght 24
uint32_t dword_0;
uint32_t dword_4;
uint32_t dword_8;
uint32_t dword_12;
uint16_t word_16;
uint16_t word_18;
uint16_t word_20;
uint16_t word_22;
}
type_E1BAC_0x3c4;
#pragma pack (16)

//0x2ec
type_E1BAC_0x3c4 str_E1BAC_0x2ec[9] = {
{0x0005BC1E,0x000032D0,0x00076BBD,0x00000300,0x00F4,0x0085,0x0088,0x015C},
{0x0005EEEE,0x00003282,0x00076EBD,0x00000300,0x00D0,0x0081,0x00B4,0x0160},
{0x00062170,0x00003BE3,0x000771BD,0x00000300,0x00E2,0x0090,0x0096,0x0151},
{0x00065D53,0x000042B6,0x000774BD,0x00000300,0x00E0,0x006F,0x00A4,0x0172},
{0x0006A009,0x00003029,0x000777BD,0x00000300,0x00EC,0x0070,0x009C,0x0171},
{0x0006D032,0x00002E89,0x00077ABD,0x00000300,0x00E0,0x0087,0x00B4,0x0160},
{0x0006FEBB,0x00003BDC,0x00077DBD,0x00000300,0x00DD,0x0084,0x00A5,0x015D},
{0x00073A97,0x00003126,0x000780BD,0x00000300,0x00F0,0x008B,0x008C,0x0156},
{0x00000000,0x00000000,0x00000000,0x00000000,0x0000,0x0000,0x0000,0x0000} };

#pragma pack (1)
typedef struct {//lenght 69
	int32_t dword_0;//0
	uint8_t stub_4;//4
	uint8_t stub_5;//5
	uint8_t stub_6;//6
	uint8_t stub_7;//7
	uint8_t stub_8;//8
	uint8_t stub_9;//9
	int16_t word_10;//10	
	int8_t byte_12;//12
	uint8_t stub_13;//13
	int16_t word_14;//14	
	int8_t byte_16;//16
	uint8_t stub_17;//17
	int16_t array_word_18[12];////18
	int8_t byte_42;//42
	int8_t byte_43;//43
	uint8_t byte_44;//44
	int16_t array_word_45[12];//45
}
type_WORD_E20A4;
#pragma pack (16)

type_WORD_E20A4 str_WORD_E20A4[12] = {
{0x00000000,0x00,0x00,0x00,0x00,0x01,0x00,0x0025,0x02,0x00,0x0025,0x03,0x00,{0x0000,0x0000,0x0180,0x0000,0x021F,0x03C0,0x008C,0x0091,0x008C,0x008C,0x0091,0x0032},0x01,0x00,0x03,{0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000}},
{0x00000000,0x00,0x00,0x00,0x00,0x01,0x00,0x0025,0x02,0x00,0x0025,0x03,0x00,{0x0000,0x0000,0x018B,0x000A,0x0226,0x03CA,0x008C,0x0091,0x008C,0x008C,0x0091,0x0032},0x01,0x00,0x03,{0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000}},
{0x00000000,0x00,0x00,0x00,0x00,0x01,0x00,0x0025,0x02,0x00,0x0025,0x03,0x00,{0x0000,0x0000,0x0190,0x0006,0x022B,0x03D4,0x008C,0x0091,0x008C,0x008C,0x0091,0x0032},0x01,0x00,0x03,{0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000,0x0000}},
